Файлы
1) Записать массив товаров в csv файл

2) Прочитать массив товаров из csv файлов в моделе.

3) Добавить папку /admin со своим index.php и контроллером и вьюхой

4) Ссылка на товар с ид в наименовании - проверяем что в $_GET есть
ид товара и показываем только этот товар, остальные не показываем.
Логика в контролере используем array_filter()

5) Сделать в верху страницы форму авторизации (ввод имени), сохранить
в сессии $_SESSION и дальше если имя в сессии, то выводить вверху
"Привет имя" и форму уже не показывать

6)
